#Область ОбработчикиСобытийФормы

&НаСервере
Процедура пр_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	пр_УправлениеЭлементамиФормы();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура пр_УправлениеЭлементамиФормы()
	
	#Область Заказ
	
	// Переопределения поля с заказом
	Элементы.Заказ.Видимость = Ложь;
	
	// Добавление поля вместо заказа
	КонтекстПоля = РедакторФорм.СоздатьКонтекстЭлемента(ЭтаФорма, Элементы.ГруппаЗаказОснование, Элементы.Заказ);	
	КонтекстПоля.Свойства.Вставить("ПутьКДанным", 	"Объект.Заказ");
	КонтекстПоля.Свойства.Вставить("Заголовок", 	"Заказ");
	ПолеФормы = РедакторФорм.ДобавитьПолеНаФорму(КонтекстПоля, "ЗаказПериод");
	ПолеФормы.МаксимальнаяШирина 		= 36;
	ПолеФормы.АвтоМаксимальнаяШирина 	= Ложь;
	
	#КонецОбласти 
	
	#Область РеквизитыПР
	
	// Группа ПР
	КонтекстГруппы = РедакторФорм.СоздатьКонтекстЭлемента(ЭтотОбъект, Элементы.ДополнительноЛеваяКолонка);
	КонтекстГруппы.Свойства.Вставить("Заголовок", "Простые решения");
	КонтекстГруппы.Свойства.Вставить("ОтображатьЗаголовок", Истина);
 	ГруппаРеквизитыПР = РедакторФорм.ДобавитьГруппуОбычную(КонтекстГруппы, "ГруппаПростыеРешения");
	
	// франДатаСдачи
	КонтекстПоля = РедакторФорм.СоздатьКонтекстЭлемента(ЭтотОбъект, ГруппаРеквизитыПР, ГруппаРеквизитыПР);	
	КонтекстПоля.Свойства.Вставить("ПутьКДанным", 	"Объект.франДатаСдачи");
	КонтекстПоля.Свойства.Вставить("Заголовок", 	"Дата сдачи");
	ПолеФормы = РедакторФорм.ДобавитьПолеНаФорму(КонтекстПоля, "франДатаСдачи");
	
	// франСдан
	КонтекстПоля = РедакторФорм.СоздатьКонтекстЭлемента(ЭтотОбъект, ГруппаРеквизитыПР, ГруппаРеквизитыПР);	
	КонтекстПоля.Свойства.Вставить("ПутьКДанным", 	"Объект.франСдан");
	КонтекстПоля.Свойства.Вставить("Заголовок", 	"Сдан");
	КонтекстПоля.Свойства.Вставить("Вид", 			ВидПоляФормы.ПолеФлажка);
	ПолеФормы = РедакторФорм.ДобавитьПолеНаФорму(КонтекстПоля, "франСдан");
	
	// франАвтор
	КонтекстПоля = РедакторФорм.СоздатьКонтекстЭлемента(ЭтотОбъект, ГруппаРеквизитыПР, ГруппаРеквизитыПР);	
	КонтекстПоля.Свойства.Вставить("ПутьКДанным", 	"Объект.франАвтор");
	КонтекстПоля.Свойства.Вставить("Заголовок", 	"Автор (франчайзи)");
	ПолеФормы = РедакторФорм.ДобавитьПолеНаФорму(КонтекстПоля, "франАвтор");
	
	// франВидРеализации
	КонтекстПоля = РедакторФорм.СоздатьКонтекстЭлемента(ЭтотОбъект, ГруппаРеквизитыПР, ГруппаРеквизитыПР);	
	КонтекстПоля.Свойства.Вставить("ПутьКДанным", 	"Объект.франВидРеализации");
	КонтекстПоля.Свойства.Вставить("Заголовок", 	"Вид реализации");
	ПолеФормы = РедакторФорм.ДобавитьПолеНаФорму(КонтекстПоля, "франВидРеализации");
	
	// франЗаявкаНаПодпискуИТС
	КонтекстПоля = РедакторФорм.СоздатьКонтекстЭлемента(ЭтотОбъект, ГруппаРеквизитыПР, ГруппаРеквизитыПР);	
	КонтекстПоля.Свойства.Вставить("ПутьКДанным", 	"Объект.франЗаявкаНаПодпискуИТС");
	КонтекстПоля.Свойства.Вставить("Заголовок", 	"Заявка на подписку ИТС");
	ПолеФормы = РедакторФорм.ДобавитьПолеНаФорму(КонтекстПоля, "франЗаявкаНаПодпискуИТС");
	
	// ТУ_статус
	КонтекстПоля = РедакторФорм.СоздатьКонтекстЭлемента(ЭтотОбъект, ГруппаРеквизитыПР, ГруппаРеквизитыПР);	
	КонтекстПоля.Свойства.Вставить("ПутьКДанным", 	"Объект.ТУ_статус");
	КонтекстПоля.Свойства.Вставить("Заголовок", 	"Статус");
	ПолеФормы = РедакторФорм.ДобавитьПолеНаФорму(КонтекстПоля, "ТУ_статус");
	
	#КонецОбласти 
	
	#Область РеквизитыУправленческогоУчета
	
	// Переход с УПП
	пр_РаботаСФормами.пр_ДобавитьФлажкиПринадлежностиУчетовНаФорму(ЭтаФорма, Элементы.ДополнительноЛеваяКолонка);
	
	#КонецОбласти 
		
КонецПроцедуры

&НаСервереБезКонтекста
Функция пр_ВидДоговораПоПериодам(Договор)
	
	Возврат Справочники.ДоговорыКонтрагентов.пр_ВидДоговораПоПериодам(Договор);
	
КонецФункции

#КонецОбласти
