
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура пр_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	пр_РаботаСОбращениямиСервер.ПриСозданииНаСервереФормыЭлектронногоПисьма(ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура пр_ПриОткрытииПосле(Отказ)
	
	пр_РаботаСОбращениямиКлиент.ОбновитьСвойстваКнопкиПривязатьОбращение(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура пр_ОбработкаОповещенияПосле(ИмяСобытия, Параметр, Источник)
	
	пр_РаботаСОбращениямиКлиент.ОбработкаОповещенияФормыЭлектронногоПисьма(ЭтаФорма, ИмяСобытия, Параметр);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура пр_ПривязатьОбращениеИзСписка(Команда)
	
	пр_РаботаСОбращениямиКлиент.ПривязатьОбращениеИзСпискаКЭлектронномуПисьму(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура пр_ПривязатьОбращениеПосле(Команда)
	
	пр_РаботаСОбращениямиКлиент.ПривязатьОбращениеКЭлектронномуПисьму(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти




