#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
     	
#Область ОбработчикиСобытий

&После("ПриЗаписи")
Процедура пр_ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;	
	КонецЕсли; 
	
	Если франСозданОбработкой Тогда
		
		НаборЗаписей = РегистрыСведений.франИсторияПакетногоФормирования.СоздатьНаборЗаписей();
		
		НаборЗаписей.Отбор.Документ.Установить(Ссылка);

		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Документ 	= Ссылка;
		НоваяЗапись.Дата 	 	= Дата;
		НоваяЗапись.Организация	= Организация;
		НоваяЗапись.Контрагент	= Контрагент;
		
		НаборЗаписей.Записать();

	КонецЕсли; 

КонецПроцедуры

#КонецОбласти

#КонецЕсли 
