#Область ОбработчикиСобытийФормы

&НаСервере
Процедура пр_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	пр_ОбновитьТекстЗапросаСписка();
	пр_УправлениеЭлементамиФормы();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура пр_ОбновитьТекстЗапросаСписка()
	
	ТекстЗамены = "СправочникПартнеры.Ссылка,";
	
	ТекстДобавляемыеПоля = 
		"
		|СправочникПартнеры.Ссылка,		
		|	ВЫБОР
		|		КОГДА СправочникПартнеры.ЭтоГруппа
		|			ТОГДА 4
		|		КОГДА СправочникПартнеры.пр_ЕстьПакетныйДоговор
		|			ТОГДА 2
		|		КОГДА СправочникПартнеры.пр_ЕстьАбонДоговор
		|			ТОГДА 3
		|		КОГДА СправочникПартнеры.пр_ЕстьИТСДоговор
		|			ТОГДА 5
		|		ИНАЧЕ 4
		|	КОНЕЦ КАК пр_ПиктограммаДоговор,
		|	ВЫБОР
		|		КОГДА СправочникПартнеры.пр_ПерваяЛиния ЕСТЬ NULL
		|			ТОГДА 2
		|		КОГДА СправочникПартнеры.пр_ВтораяЛиния
		|				И НЕ СправочникПартнеры.пр_ПерваяЛиния
		|			ТОГДА 1
		|		КОГДА СправочникПартнеры.пр_ПерваяЛиния
		|			ТОГДА 0
		|		ИНАЧЕ 2
		|	КОНЕЦ КАК пр_ПиктограммаПерваяЛиния,
		|	ВЫБОР
		|		КОГДА СправочникПартнеры.пр_ВтораяЛиния ЕСТЬ NULL
		|			ТОГДА 2
		|		КОГДА СправочникПартнеры.пр_ПерваяЛиния
		|				И НЕ СправочникПартнеры.пр_ВтораяЛиния
		|			ТОГДА 1
		|		КОГДА СправочникПартнеры.пр_ВтораяЛиния
		|			ТОГДА 0
		|		ИНАЧЕ 2
		|	КОНЕЦ КАК пр_ПиктограммаВтораяЛиния,
		|	ВЫБОР
		|		КОГДА СправочникПартнеры.пр_ЕстьФрэш ЕСТЬ NULL
		|			ТОГДА 1
		|		КОГДА СправочникПартнеры.пр_ЕстьФрэш
		|			ТОГДА 0
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК пр_ПиктограммаЕстьФреш,
		|	СправочникПартнеры.Ответственный <> ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка) КАК пр_ЕстьМенеджер,";
	
	Список.ТекстЗапроса = СтрЗаменить(Список.ТекстЗапроса, ТекстЗамены, ТекстДобавляемыеПоля);
	
КонецПроцедуры

&НаСервере
Процедура пр_УправлениеЭлементамиФормы()
	
	// Пиктограмма Договор
	КонтекстПоля = РедакторФорм.СоздатьКонтекстЭлемента(ЭтаФорма, Элементы.Список, Элементы.Код);
	
	ПиктограмаДоговор = РедакторФорм.ДобавитьПолеНаФорму(КонтекстПоля, "пр_ПикторгаммаДоговор");
	ПиктограмаДоговор.Вид 				= ВидПоляФормы.ПолеКартинки;
	ПиктограмаДоговор.ПутьКДанным 		= "Список.пр_ПиктограммаДоговор";
	ПиктограмаДоговор.Подсказка 		= "Вид договора";
	ПиктограмаДоговор.КартинкаЗначений 	= БиблиотекаКартинок.пр_ВидыДоговоров;
	
	ЗаполнитьЗначенияСвойств(ПиктограмаДоговор, Элементы.Список.ПодчиненныеЭлементы["ЗаполненностьИнформации"], , 
		"Вид, КартинкаЗначений, Подсказка, ПутьКДанным"); 
	
	// Пиктограмма Первая линия
	КонтекстПоля = РедакторФорм.СоздатьКонтекстЭлемента(ЭтаФорма, Элементы.Список, Элементы.Код);
	
	ПиктограмаПерваяЛиния = РедакторФорм.ДобавитьПолеНаФорму(КонтекстПоля, "пр_ПиктограммаПерваяЛиния");
	ПиктограмаПерваяЛиния.Вид 				= ВидПоляФормы.ПолеКартинки;
	ПиктограмаПерваяЛиния.ПутьКДанным 		= "Список.пр_ПиктограммаПерваяЛиния";
	ПиктограмаПерваяЛиния.Подсказка 		= "Первая линия";
	ПиктограмаПерваяЛиния.КартинкаЗначений 	= БиблиотекаКартинок.пр_СтатусыПеровойЛинии;
	
	ЗаполнитьЗначенияСвойств(ПиктограмаПерваяЛиния, Элементы.Список.ПодчиненныеЭлементы["ЗаполненностьИнформации"], , 
		"Вид, КартинкаЗначений, Подсказка, ПутьКДанным"); 
	
	// Пиктограмма Вторая линия
	КонтекстПоля = РедакторФорм.СоздатьКонтекстЭлемента(ЭтаФорма, Элементы.Список, Элементы.Код);
	
	ПиктограмаВтораяЛиния = РедакторФорм.ДобавитьПолеНаФорму(КонтекстПоля, "пр_ПиктограммаВтораяЛиния");
	ПиктограмаВтораяЛиния.Вид 				= ВидПоляФормы.ПолеКартинки;
	ПиктограмаВтораяЛиния.ПутьКДанным 		= "Список.пр_ПиктограммаВтораяЛиния";
	ПиктограмаВтораяЛиния.Подсказка 		= "Вторая линия";
	ПиктограмаВтораяЛиния.КартинкаЗначений 	= БиблиотекаКартинок.пр_СтатусыВторойЛинии;
	
	ЗаполнитьЗначенияСвойств(ПиктограмаВтораяЛиния, Элементы.Список.ПодчиненныеЭлементы["ЗаполненностьИнформации"], , 
		"Вид, КартинкаЗначений, Подсказка, ПутьКДанным"); 
	
	// Пиктограмма Есть фреш
	КонтекстПоля = РедакторФорм.СоздатьКонтекстЭлемента(ЭтаФорма, Элементы.Список, Элементы.Код);
	
	ПиктограмаЕстьФреш = РедакторФорм.ДобавитьПолеНаФорму(КонтекстПоля, "пр_ПиктограммаЕстьФреш");
	ПиктограмаЕстьФреш.Вид 				= ВидПоляФормы.ПолеКартинки;
	ПиктограмаЕстьФреш.ПутьКДанным 		= "Список.пр_ПиктограммаЕстьФреш";
	ПиктограмаЕстьФреш.Подсказка 		= "Есть фреш";
	ПиктограмаЕстьФреш.КартинкаЗначений = БиблиотекаКартинок.пр_СтатусыФреш;
	
	ЗаполнитьЗначенияСвойств(ПиктограмаЕстьФреш, Элементы.Список.ПодчиненныеЭлементы["ЗаполненностьИнформации"], , 
		"Вид, КартинкаЗначений, Подсказка, ПутьКДанным"); 
	
	// Флажок Есть Менеджер
	КонтекстПоля = РедакторФорм.СоздатьКонтекстЭлемента(ЭтаФорма, Элементы.Список, Элементы.Код);
	
	ФлажокЕстьФреш = РедакторФорм.ДобавитьПолеНаФорму(КонтекстПоля, "пр_ЕстьМенеджер");
	ФлажокЕстьФреш.Вид 					= ВидПоляФормы.ПолеФлажка;
	ФлажокЕстьФреш.ПутьКДанным 			= "Список.пр_ЕстьМенеджер";
	ФлажокЕстьФреш.Подсказка 			= "Есть менеджер";
	ФлажокЕстьФреш.ПоложениеЗаголовка 	= ПоложениеЗаголовкаЭлементаФормы.Нет;
	
КонецПроцедуры

#КонецОбласти






















