#Область СлужебныеПроцедурыИФункции

&После("ОпределитьРазделыСВариантамиОтчетов")
Процедура пр_ОпределитьРазделыСВариантамиОтчетов(Разделы)
	
	Разделы.Добавить(Метаданные.Подсистемы.пр_Производство, 		НСтр("ru = 'Обращения'"));
	Разделы.Добавить(Метаданные.Подсистемы.пр_ДоговорыСервисы, 		НСтр("ru = 'Обновления, ИТС'"));
	Разделы.Добавить(Метаданные.Подсистемы.пр_Администрирование, 	НСтр("ru = 'Простые решения'"));
	
КонецПроцедуры

&После("НастроитьВариантыОтчетов")
Процедура пр_НастроитьВариантыОтчетов(Настройки)
	
	// пр_ОтчетСостояниеДелПоКлиенту
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.пр_ОтчетСостояниеДелПоКлиенту, "СостояниеДелПоКлиенту");
	Вариант.Описание = НСтр("ru = 'Отчет позволяет получить информацию по выполенным работам для клиента.'");

	// пр_ЧтениеСрезаДанныхРегистровДляПерехода
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.пр_ЧтениеСрезаДанныхРегистровДляПерехода, "ОсновнойСрезДанных");
	Вариант.Описание = НСтр("ru = 'Отчет выводит расхождения регистров между данными УПП и УНФ.'");
	
	Если Вариант.Наименование = "Взаиморасчеты" Тогда
		Вариант.Наименование = "Сравнение остатков регистров УПП и УНФ.";	
	КонецЕсли; 
	
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.пр_ЧтениеСрезаДанныхРегистровДляПерехода, "Остатки");
	Вариант.Описание = НСтр("ru = 'Расхождения остатков номенклатуры между УПП и УНФ.'");
	Вариант.Включен = Ложь;
	
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.пр_ЧтениеСрезаДанныхРегистровДляПерехода, "Сервисы");
	Вариант.Описание = НСтр("ru = 'Расхождения остатков сервисов между УПП и УНФ.'");
	Вариант.Включен = Ложь;
	
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.пр_ЧтениеСрезаДанныхРегистровДляПерехода, "Кассы");
	Вариант.Описание = НСтр("ru = 'Расхождения остатков в кассах между УПП и УНФ.'");
	Вариант.Включен = Ложь;
	
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.пр_ЧтениеСрезаДанныхРегистровДляПерехода, "Банк");
	Вариант.Описание = НСтр("ru = 'Расхождения остатков на банковских счетах между УПП и УНФ.'");
	Вариант.Включен = Ложь;
	
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.пр_ЧтениеСрезаДанныхРегистровДляПерехода, "ЧасыКлиентов");
	Вариант.Описание = НСтр("ru = 'Расхождения остатков часов клиентов между УПП и УНФ.'");
	Вариант.Включен = Ложь;
	
	// пр_ОбъединенныйОтчетПоОбновлениям
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.пр_ОбъединенныйОтчетПоОбновлениям, "ОбъединенныйПоОбновлениям");
	Вариант.Описание = НСтр("ru = 'Отчет выводит данные по обновлениям.'");
	
	// пр_ОбращенияЗаПериод
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.пр_ОбращенияЗаПериод, "ОбращенияПоСтатусам");
	Вариант.Описание = НСтр("ru = 'Отчет выводит обращения по статусам.'");
	
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.пр_ОбращенияЗаПериод, "РейтингСотрудников");
	Вариант.Описание = НСтр("ru = 'Отчет выводит количество обращений, обработанных сотрудником.'");
	
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.пр_ОбращенияЗаПериод, "РейтингВидовОбращений");
	Вариант.Описание = НСтр("ru = 'Отчет выводит рейтинг обращений по видам.'");
	
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.пр_ОбращенияЗаПериод, "ДляЗП");
	Вариант.Описание = НСтр("ru = 'Отчет выводит количество обращений по 1й линии.'");
	
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.пр_ОбращенияЗаПериод, "ДляЮли");
	Вариант.Описание = НСтр("ru = 'Отчет выводит обращения за вчерашний день.'");
	
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.пр_ОбращенияЗаПериод, "ПоискИсполнителя");
	Вариант.Описание = НСтр("ru = 'Отчет выводит обращения в поиске исполнителя.'");
	
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.пр_ОбращенияЗаПериод, "Протухли");
	Вариант.Описание = НСтр("ru = 'Отчет выводит обращения, не закрытые более 2х недель.'");
	
	// пр_ЗакрытыеОбращенияЗаПериод
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.пр_ЗакрытыеОбращенияЗаПериод, "ОбращенияПоДням");
	Вариант.Описание = НСтр("ru = 'Отчет выводит обращения по дням.'");
	
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.пр_ЗакрытыеОбращенияЗаПериод, "ОбращениПоВидамОбращений");
	Вариант.Описание = НСтр("ru = 'Отчет выводит обращения по видам.'");
	Вариант.Включен = Ложь;

	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.пр_ЗакрытыеОбращенияЗаПериод, "ОбращениПоСотрудникам");
	Вариант.Описание = НСтр("ru = 'Отчет выводит обращения по сотрудникам.'");
	Вариант.Включен = Ложь;
	
	// пр_ОтчетПоАктуальнымОбращениям
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.пр_ОтчетПоАктуальнымОбращениям, "ПоАктуальнымОбращениям");
	Вариант.Описание = НСтр("ru = 'Отчет выводит актуальные обращения.'");
	
	// пр_КонтрагентыДолгиИСборДокументов
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.пр_КонтрагентыДолгиИСборДокументов, "КонтрагентыДолгиИСборДокументов");
	Вариант.Описание = НСтр("ru = 'Отчет выводит состояние взаиморасчетов клиентов.'");
	
	// пр_КадровояИнформация
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.пр_КадроваяИнформация, "КадроваяИнформация");
	Вариант.Описание = НСтр("ru = 'Отчет выводит состояние сотрудников, уровни грейдов и показатели расчета ЗП.'");
	
	// пр_ОтчетПоПакетамЧасов
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.пр_ОтчетПоПакетамЧасов, "ПакетыЧасовКлиента");
	Вариант.Описание = НСтр("ru = 'Отчет выводит движения по пакету часов клиента.'");
	
	// пр_ВыполненныеРаботы
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.пр_ВыполненныеРаботы, "ВыполненныеРаботы");
	Вариант.Описание = НСтр("ru = 'Отчет выводит отработанные часы сотрудников.'");

	
КонецПроцедуры

#КонецОбласти
