#Область ОбработчикиСобытийФормы

&НаСервере
Процедура пр_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	пр_УправлениеЭлементамиФормы();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыРасходы

&НаКлиенте
Процедура пр_РасходыПриИзмененииПосле(Элемент)
	
	ТекущиеДанные = Элементы.Расходы.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда 	
		Возврат;
	КонецЕсли; 
	
	Если НЕ ЗначениеЗаполнено(ТекущиеДанные.СчетЗатрат) И ЗначениеЗаполнено(ТекущиеДанные.Номенклатура) Тогда
		
		ТекущиеДанные.СчетЗатрат = пр_ПереходНаУНФВызовСервера.СчетУчетаЗатратНоменклатуры(ТекущиеДанные.Номенклатура);	
		
	КонецЕсли; 

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура пр_УправлениеЭлементамиФормы()
	
	// Добавление в табличную часть "Расходы" Поля "СчетЗатрат"
	КонтекстПоля = РедакторФорм.СоздатьКонтекстЭлемента(ЭтаФорма, Элементы.Расходы);	
	КонтекстПоля.Свойства.Вставить("ПутьКДанным", 	"Объект.Расходы.СчетЗатрат");
	КонтекстПоля.Свойства.Вставить("Заголовок", 	"Счет затрат");
	КонтекстПоля.Свойства.Вставить("Доступность", 	Истина);
	
	ПолеФормы = РедакторФорм.ДобавитьПолеНаФорму(КонтекстПоля, "РасходыСчетЗатрат");
	
	// переход с УПП
	пр_РаботаСФормами.пр_ДобавитьФлажкиПринадлежностиУчетовНаФорму(ЭтаФорма, Элементы.ГруппаПраво);
		
КонецПроцедуры

#КонецОбласти

