#Область ОбработчикиСобытийФормы

&НаСервере
Процедура пр_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	пр_ИзменениеЭлементовФормы(); 	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура пр_ИзменениеЭлементовФормы()
		
	СвойстваГруппы = Новый Структура;
	СвойстваГруппы.Вставить("Вид", 			ВидГруппыФормы.ОбычнаяГруппа);
	СвойстваГруппы.Вставить("Заголовок", 	"Франчайзи");
	СвойстваГруппы.Вставить("Группировка", 	ГруппировкаПодчиненныхЭлементовФормы.Вертикальная);
	КонтекстГруппы = РедакторФорм.СоздатьКонтекстЭлемента(ЭтаФорма, Элементы.СтраницаРеквизитыУНФ, Элементы.ГруппаДополнительныеРеквизиты, СвойстваГруппы);	
	ГруппаДополнительноеОписание = РедакторФорм.ДобавитьГруппуНаФорму(КонтекстГруппы, "пр_ГруппаДополнительноеОписание");
	
	КонтекстПоля = РедакторФорм.СоздатьКонтекстЭлемента(ЭтаФорма, ГруппаДополнительноеОписание);
	ПолеФормы = РедакторФорм.ДобавитьПолеФлажкаНаФормуРеквизитОбъекта(КонтекстПоля, "пр_НеУпоминатьВЧате");

	КонтекстПоля = РедакторФорм.СоздатьКонтекстЭлемента(ЭтаФорма, ГруппаДополнительноеОписание);	
	ПолеФормы = РедакторФорм.ДобавитьРеквизитОбъектаНаФорму(КонтекстПоля, "пр_GSuiteГруппа");
	
	КонтекстПоля = РедакторФорм.СоздатьКонтекстЭлемента(ЭтаФорма, ГруппаДополнительноеОписание);	
	ПолеФормы = РедакторФорм.ДобавитьРеквизитОбъектаНаФорму(КонтекстПоля, "пр_RocketChatОбщийКанал");
	
	КонтекстПоля = РедакторФорм.СоздатьКонтекстЭлемента(ЭтаФорма, ГруппаДополнительноеОписание);
	ПолеФормы = РедакторФорм.ДобавитьРеквизитОбъектаНаФорму(КонтекстПоля, "пр_ОсновнойТипЗадания");
	
КонецПроцедуры

#КонецОбласти
  

