#Область ОбработчикиСобытийФормы

&НаСервере
Процедура пр_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	пр_ИзменениеЭлементовФормы(); 	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Аннотация не требуется, см. имя метода
//
// Параметры:
//  Нет
//    
&НаСервере
Процедура пр_ИзменениеЭлементовФормы()
	
	// Дополнительное описание
	СвойстваГруппы = Новый Структура;
	СвойстваГруппы.Вставить("Вид", ВидГруппыФормы.ОбычнаяГруппа);
	СвойстваГруппы.Вставить("Заголовок", "Франчайзи");
	СвойстваГруппы.Вставить("Группировка", ГруппировкаПодчиненныхЭлементовФормы.Вертикальная);
	КонтекстГруппы = РедакторФорм.СоздатьКонтекстЭлемента(ЭтаФорма, Элементы.ГруппаДополнительныеРеквизитыОбщая, Элементы.СтраницаДополнительныеРеквизиты, СвойстваГруппы);	
	ГруппаДополнительноеОписание = РедакторФорм.ДобавитьГруппуНаФорму(КонтекстГруппы, "пр_ГруппаДополнительноеОписание");
	
	КонтекстПоля = РедакторФорм.СоздатьКонтекстЭлемента(ЭтаФорма, ГруппаДополнительноеОписание);	
	КонтекстПоля.Свойства.Вставить("ПутьКДанным", 	"Объект.idАбонентаФРЕШ");
	КонтекстПоля.Свойства.Вставить("Заголовок", 	"id абонента ФРЕШ");
	ПолеФормы = РедакторФорм.ДобавитьПолеНаФорму(КонтекстПоля, "idАбонентаФРЕШ");
	
КонецПроцедуры

#КонецОбласти
  

