
&НаСервере
&ИзменениеИКонтроль("ПриСозданииНаСервере")
Процедура пр_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// +Этот блок обязательно должен быть в самом начале процедуры, чтобы при отказе не выполнять избыточный код.
	Если НЕ CRM_РежимФормЗакладкиСервер.ВосстановлениеФормыПриЗапускеСеанса(ЭтотОбъект, Отказ, СтандартнаяОбработка) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	// -Этот блок обязательно должен быть в самом начале процедуры, чтобы при отказе не выполнять избыточный код.

	#Удаление  
	Попытка
		Если НЕ CRM_ЛицензированиеСервер.ПодсистемаCRMИспользуется() Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Невозможно открыть Почтовый клиент. Подсистема 1С:CRM не используется! (см. Персональные настройки пользователя)';en='Unable to open email client. Subsystem 1C: CRM is not used! (see Personal settings of the user)'"));
			Отказ = Истина;
			Возврат;
		КонецЕсли;
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Нстр("ru='Работа почтового клиента в этом режиме не поддерживается!';en='The operation of the mail customer in this mode is not supported!'"));
		Отказ = Истина;
		Возврат;
	КонецПопытки;

	CRM_ЛицензированиеСервер.ПолучитьЗащищеннуюОбработку().ПриСозданиеНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка); 
	#КонецУдаления

	КэшТипыСправочниковПрисоединенныхФайлов = ПолучитьОписаниеТиповПрисоединенныхФайлов();

	ЕстьПравоДобавленияУчетныхЗаписей = ПравоДоступа("Добавление", Метаданные.Справочники.УчетныеЗаписиЭлектроннойПочты);

	// Оформление списка

	ЕстьИсточникиЛидов = Ложь;
	ЗаполнитьСписокУчетныхЗаписей(УчетныеЗаписи, ЕстьИсточникиЛидов);
	Элементы.СписокПисемСостояниеЛида.Видимость = ЕстьИсточникиЛидов;

	ЗаполнитьДеревоУчетныхЗаписей();

	Элементы.СписокПисемПоказатьСкрытьПисьмо.Пометка		= ПоказатьСкрытьПисьмоПометка;
	Элементы.Описание.Видимость								= ПоказатьСкрытьПисьмоПометка;
	// Элементы.СписокПисемПоказатьСкрытьВложения.Пометка	= ЭтаФорма.ПоказатьСкрытьВложенияПометка;
	Элементы.СписокПисемПоказатьСкрытьВложения.Пометка		= ПоказатьСкрытьВложенияПометка;
	// Элементы.СписокПисемПоказатьСкрытьВложения.Доступность= ЭтаФорма.ПоказатьСкрытьВложенияПометка;
	Элементы.Вложения.Видимость								= ПоказатьСкрытьВложенияПометка;

	// Восстановление сортировки списка
	// CRM_ОбщегоНазначенияСервер.ВосстановитьСортировкуСписка(СписокПисем, "Обработка.CRM_МенеджерПочты.СписокПисем");

	// Элементы.Вложения.ОтборСтрок = Новый ФиксированнаяСтруктура("ИДФайлаЭлектронногоПисьмаОтбор","#");
	Элементы.Вложения.ОтборСтрок = Новый ФиксированнаяСтруктура("ИДФайлаЭлектронногоПисьма","#");

	// Показать/Скрыть список учетных записей
	ПоказатьСписокУчетныхЗаписей = ХранилищеОбщихНастроекЗагрузить(ЭтотОбъект.ИмяФормы, "СписокУчетныхЗаписей");
	Если ПоказатьСписокУчетныхЗаписей = Неопределено Тогда
		Элементы.ПанельУправления.Видимость = Истина;
		ХранилищеОбщихНастроекСохранить(ЭтотОбъект.ИмяФормы, "СписокУчетныхЗаписей", Истина);
	Иначе
		Элементы.ПанельУправления.Видимость = ПоказатьСписокУчетныхЗаписей;
	КонецЕсли;
	Если Элементы.ПанельУправления.Видимость Тогда
		Элементы.ПоказатьСкрытьДеревоУчетныхЗаписей.Заголовок = НСтр("ru='Скрыть список учетных записей';en='Hide account list'");
	Иначе
		Элементы.ПоказатьСкрытьДеревоУчетныхЗаписей.Заголовок = НСтр("ru='Показать список учетных записей';en='Show Account List'");
	КонецЕсли;
	ЗапрещенныеРасширения = РаботаСФайламиСлужебный.СписокЗапрещенныхРасширений();	

	ИспользоватьЗаявки = ПолучитьФункциональнуюОпцию("CRM_ИспользоватьЗаявки") И (Пользователи.ЭтоПолноправныйПользователь() ИЛИ РольДоступна("CRM_ДобавлениеИзменениеЗаявок"));

	Элементы.СписокПисемУчетныеЗаписиЭлектроннойПочты.Видимость 					= ЕстьПравоДобавленияУчетныхЗаписей;
	Элементы.ПанельУправленияКонтекстноеМенюУчентыеЗаписиЭлектроннойПочты.Видимость = ЕстьПравоДобавленияУчетныхЗаписей;
	Элементы.ПанельУправленияКонтекстноеМенюДобавитьУчетнуюЗапись.Видимость 		= ЕстьПравоДобавленияУчетныхЗаписей;
	Элементы.ПанельУправленияКонтекстноеМенюРедактироватьПочтовыеПапки.Видимость	= ЕстьПравоДобавленияУчетныхЗаписей;

	ПолучитьПочтуПриОткрытии = Параметры.Свойство("ПолучитьПочтуПриОткрытии");


	// +Рабочий стол
	CRM_СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	// -Рабочий стол
	// +CRM_УНФ
	//// +Доступные пользователи
	//МассивЭлементовОтбора = Новый Массив;
	//МассивЭлементовОтбора.Добавить("Ответственный");
	//УстановитьОтборВСпискеПоДоступнымпользователям(СписокПисем, МассивЭлементовОтбора);
	//// -Доступные пользователи
	// -CRM_УНФ
	УстановитьУО();

КонецПроцедуры
