
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура пр_пр_ЗакрытьЗаВыбранныйПериодПосле(Команда)
	
	ОткрытьФорму("Обработка.ЗакрытиеМесяца.Форма.пр_ФормаЗакрытияВсехМесяцев",
		Новый Структура("Организация", Объект.Организация),
		ЭтаФорма,
		УникальныйИдентификатор, , ,
		Новый ОписаниеОповещения("пр_ЗакрытьВыбранныеМесяцыЗавершение", ЭтотОбъект),
		РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура пр_ЗакрытьВыбранныеМесяцыЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;	
	КонецЕсли; 
	
	СчетчикМесяцев = 1;
	Для каждого ПараметрыЗакрытия Из Результат Цикл
		
		 Состояние(СтрШаблон(НСтр("ru='Закрытие месяца №%1 год: %2'"), 
		 		Формат(ПараметрыЗакрытия.ТекМесяц, "ЧН=0; ЧГ=0"), 
				Формат(ПараметрыЗакрытия.ТекГод, "ЧН=0; ЧГ=0")), 
			Окр(СчетчикМесяцев / Результат.Количество() * 100, 0),
			НСтр("ru='Закрытие месяца'"),
			БиблиотекаКартинок.ЗакрытиеМесяцаНепроводилось);
			
		пр_ВыполнитьЗакрытиеНаСервере(ПараметрыЗакрытия);	
			
		СчетчикМесяцев = СчетчикМесяцев + 1;
		 
	КонецЦикла;	
	
	УстановитьТекстНадписей();
	ПолучитьИнформациюПоЗакрытиюПериодов();
	Элементы.СформироватьОтчет.Доступность = СписокЗакрытийМесяцев[ТекМесяц - 1].Значение;
	
КонецПроцедуры

&НаСервере
Процедура пр_ВыполнитьЗакрытиеНаСервере(ПараметрыЗакрытия);
	
	Обработки.ЗакрытиеМесяца.ВыполнитьЗакрытиеМесяца(ПараметрыЗакрытия);
	
КонецПроцедуры

#КонецОбласти



