#Область ПрограммныйИнтерфейс

// Метод добавляет реквизиты документа "ОтражатьВБухгалтерскомУчете" и "ОтражатьВУправленческомУчете" на форму
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма документа.
//  ЭлементРодитель - ГруппаФормы - Группа, в которую необходимо поместить флажки.
//	Пераметр3 - Тип1Параметра3 - ОписаниеТип1Параметра3.
//
Процедура пр_ДобавитьФлажкиПринадлежностиУчетовНаФорму(Форма, ЭлементРодитель) Экспорт
	
	// Группа переход с УПП
	КонтекстГруппы = РедакторФорм.СоздатьКонтекстЭлемента(Форма, ЭлементРодитель);
	КонтекстГруппы.Свойства.Вставить("Заголовок", НСтр("ru='Реквизиты перехода из УПП'"));
	КонтекстГруппы.Свойства.Вставить("ОтображатьЗаголовок", Истина);
	
 	ГруппаРеквизитыПереходаИзУПП = РедакторФорм.ДобавитьГруппуОбычную(КонтекстГруппы, "ГруппаРеквизитыПереходаИзУПП");
	
	// ОтражатьВБухгалтерскомУчете
	КонтекстПоля = РедакторФорм.СоздатьКонтекстЭлемента(Форма, ГруппаРеквизитыПереходаИзУПП, ГруппаРеквизитыПереходаИзУПП);	
	КонтекстПоля.Свойства.Вставить("ПутьКДанным", 	"Объект.ОтражатьВБухгалтерскомУчете");
	КонтекстПоля.Свойства.Вставить("Заголовок", 	НСтр("ru='Отражать в бухгалтерском учете'"));
	КонтекстПоля.Свойства.Вставить("Вид", 			ВидПоляФормы.ПолеФлажка);
	КонтекстПоля.Свойства.Вставить("Доступность", 	Истина);
	
	ПолеФормы = РедакторФорм.ДобавитьПолеНаФорму(КонтекстПоля, "ОтражатьВБухгалтерскомУчете");
	
	// ОтражатьВУправленческомУчете
	КонтекстПоля = РедакторФорм.СоздатьКонтекстЭлемента(Форма, ГруппаРеквизитыПереходаИзУПП, ГруппаРеквизитыПереходаИзУПП);	
	КонтекстПоля.Свойства.Вставить("ПутьКДанным", 	"Объект.ОтражатьВУправленческомУчете");
	КонтекстПоля.Свойства.Вставить("Заголовок", 	НСтр("ru='Отражать в управленческом учете'"));
	КонтекстПоля.Свойства.Вставить("Вид", 			ВидПоляФормы.ПолеФлажка);
	КонтекстПоля.Свойства.Вставить("Доступность", 	Истина);
	
	ПолеФормы = РедакторФорм.ДобавитьПолеНаФорму(КонтекстПоля, "ОтражатьВУправленческомУчете");
		
КонецПроцедуры

Процедура ДобавитьРеквизитыТЧСотрудникиКадровыхДокументов(Форма, ЭлементРодитель, РасположитьПередЭлементом = Неопределено) Экспорт   
	
	КонтекстЭлемента = РедакторФорм.СоздатьКонтекстЭлемента(Форма, ЭлементРодитель, РасположитьПередЭлементом);
	ЭлементГрейд = РедакторФорм.ДобавитьПолеТабличнойЧастиНаформу(КонтекстЭлемента, "Объект.Сотрудники", "пр_Грейд");
	
	СвойстваЭлемента = Новый Структура;
	СвойстваЭлемента.Вставить("Вид", ВидГруппыФормы.ГруппаКолонок);
	КонтекстЭлементаГруппы = РедакторФорм.СоздатьКонтекстЭлемента(Форма, ЭлементРодитель, РасположитьПередЭлементом, СвойстваЭлемента);
	
	ГруппаКолонокГрейд 		= РедакторФорм.ДобавитьГруппуНаФорму(КонтекстЭлементаГруппы, "пр_ГруппаКолонокГрейд"); 
	ГруппаКолонокНормаЧасов = РедакторФорм.ДобавитьГруппуНаФорму(КонтекстЭлементаГруппы, "пр_ГруппаКолонокНормаЧасов"); 
	ГруппаКолонокОклад 		= РедакторФорм.ДобавитьГруппуНаФорму(КонтекстЭлементаГруппы, "пр_ГруппаКолонокОклад"); 
	ГруппаКолонокПремия 	= РедакторФорм.ДобавитьГруппуНаФорму(КонтекстЭлементаГруппы, "пр_ГруппаКолонокПремия"); 
	ГруппаКолонокКоэффицент = РедакторФорм.ДобавитьГруппуНаФорму(КонтекстЭлементаГруппы, "пр_ГруппаКолонокКоэффицент"); 
	ГруппаКолонокКонтроль 	= РедакторФорм.ДобавитьГруппуНаФорму(КонтекстЭлементаГруппы, "пр_ГруппаКолонокКонтроль"); 
	
	КонтекстЭлемента = РедакторФорм.СоздатьКонтекстЭлемента(Форма, ГруппаКолонокГрейд);
	КонтекстЭлемента.Свойства.Вставить("ЦветФона", WebЦвета.СветлоЖелтый);
	Если ТипЗнч(Форма.Объект.Ссылка) = Тип("ДокументСсылка.КадровоеПеремещение") Тогда
		КонтекстЭлемента.Свойства.Вставить("Заголовок", "Прежний грейд");
		ЭлементСтарыйГрейд	= РедакторФорм.ДобавитьПолеТабличнойЧастиНаформу(КонтекстЭлемента, "Объект.Сотрудники", "пр_СтарыйГрейд");
	КонецЕсли; 
	КонтекстЭлемента.Свойства.Вставить("Заголовок", "Руководитель");
	ЭлементРуководитель = РедакторФорм.ДобавитьПолеТабличнойЧастиНаформу(КонтекстЭлемента, "Объект.Сотрудники", "пр_Руководитель");
	
	КонтекстЭлемента = РедакторФорм.СоздатьКонтекстЭлемента(Форма, ГруппаКолонокНормаЧасов);
	КонтекстЭлемента.Свойства.Вставить("ЦветФона", WebЦвета.СветлоЖелтый);
	ЭлементНормаЧасовМинимум 	= РедакторФорм.ДобавитьПолеТабличнойЧастиНаформу(КонтекстЭлемента, "Объект.Сотрудники", "пр_НормаЧасовМинимум");
	ЭлементНормаЧасовМаксимум 	= РедакторФорм.ДобавитьПолеТабличнойЧастиНаформу(КонтекстЭлемента, "Объект.Сотрудники", "пр_НормаЧасовМаксимум");
	
	КонтекстЭлемента = РедакторФорм.СоздатьКонтекстЭлемента(Форма, ГруппаКолонокОклад);
	КонтекстЭлемента.Свойства.Вставить("ЦветФона", WebЦвета.СветлоЖелтый);
	ЭлементОклад 						= РедакторФорм.ДобавитьПолеТабличнойЧастиНаформу(КонтекстЭлемента, "Объект.Сотрудники", "пр_Оклад");
	ЭлементКоэффициентРабочегоВремени 	= РедакторФорм.ДобавитьПолеТабличнойЧастиНаформу(КонтекстЭлемента, "Объект.Сотрудники", "пр_КоэффициентРабочегоВремени");
	
	КонтекстЭлемента = РедакторФорм.СоздатьКонтекстЭлемента(Форма, ГруппаКолонокПремия);
	КонтекстЭлемента.Свойства.Вставить("ЦветФона", WebЦвета.СветлоЖелтый);
	ЭлементПремияЗаРезультат = РедакторФорм.ДобавитьПолеТабличнойЧастиНаформу(КонтекстЭлемента, "Объект.Сотрудники", "пр_ПремияЗаРезультат");
	ЭлементПремия4Плюс 		 = РедакторФорм.ДобавитьПолеТабличнойЧастиНаформу(КонтекстЭлемента, "Объект.Сотрудники", "пр_Премия4Плюс");
	
	КонтекстЭлемента = РедакторФорм.СоздатьКонтекстЭлемента(Форма, ГруппаКолонокКоэффицент);
	КонтекстЭлемента.Свойства.Вставить("ЦветФона", WebЦвета.СветлоЖелтый);
	ЭлементКоэффициентРабочегоВремениУменьшенный = РедакторФорм.ДобавитьПолеТабличнойЧастиНаформу(КонтекстЭлемента, "Объект.Сотрудники", "пр_КоэффициентРабочегоВремениУменьшенный");
	ЭлементКоэффициентРабочегоВремениУвеличенный = РедакторФорм.ДобавитьПолеТабличнойЧастиНаформу(КонтекстЭлемента, "Объект.Сотрудники", "пр_КоэффициентРабочегоВремениУвеличенный");
	
	КонтекстЭлемента = РедакторФорм.СоздатьКонтекстЭлемента(Форма, ГруппаКолонокКонтроль);
	КонтекстЭлемента.Свойства.Вставить("Вид", 		ВидПоляФормы.ПолеФлажка);
	КонтекстЭлемента.Свойства.Вставить("ЦветФона", 	WebЦвета.СветлоЖелтый);
	ЭлементКонтролироватьЗаполнениеОтчета	= РедакторФорм.ДобавитьПолеТабличнойЧастиНаформу(КонтекстЭлемента, "Объект.Сотрудники", "пр_КонтролироватьЗаполнениеОтчета");
	ЭлементНеЗаполнятьТипЗадания 			= РедакторФорм.ДобавитьПолеТабличнойЧастиНаформу(КонтекстЭлемента, "Объект.Сотрудники", "пр_НеЗаполнятьТипЗадания");
		
КонецПроцедуры
	
#КонецОбласти
