
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

&После("ОбработкаПроверкиЗаполнения")
Процедура пр_ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;	
	КонецЕсли; 
	
	Если КатегорияНоменклатуры = Справочники.КатегорииНоменклатуры.пр_ПрограммныйПродуктПраво
		Или КатегорияНоменклатуры = Справочники.КатегорииНоменклатуры.пр_СобственныеРазработки Тогда
		
		ПроверяемыеРеквизиты.Добавить("пр_ТипПрограммногоОбъекта");
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
	
#КонецЕсли 