
&После("ОбработкаПолученияФормОбъектовCRM")
Процедура пр_ОбработкаПолученияФормОбъектовCRM(Источник, ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	Если ТипЗнч(Источник) = Тип("СправочникМенеджер.Контрагенты") Тогда
		
		Если НЕ CRM_ОбщегоНазначенияПовтИсп.ЭтоCRM() Тогда
				
			Если ВидФормы = "ФормаСписка" Тогда
				
				Если CRM_ОбщегоНазначенияСервер.НайтиВМетаданныхПоИмени("Справочники.Контрагенты.Формы", "CRM_ФормаСписка") Тогда
					ВыбраннаяФорма = "CRM_ФормаСписка";
					СтандартнаяОбработка = Ложь;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
