
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("Организация", Организация);
	
	РасчетПрямыхЗатрат1 			= Истина;
	РаспределениеЗатрат1 			= Истина;
	РасчетФактическойСебестоимости1 = Истина;
	РасчетКурсовыхРазниц1 			= Истина;
	РасчетФинансовогоРезультата1 	= Истина;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗакрытьМесяцы(Команда)
	
	МассивМесяцев = Новый Массив;
	
	ТекущийДень = Период.ДатаНачала;
	
	Пока ТекущийДень < Период.ДатаОкончания Цикл
		
		МесяцДаты = НачалоМесяца(ТекущийДень);
		Если МассивМесяцев.Найти(МесяцДаты) = Неопределено Тогда
			
			МассивМесяцев.Добавить(МесяцДаты);
			
		КонецЕсли; 
		
		ТекущийДень = ТекущийДень + 60 * 60 * 24;
		
	КонецЦикла; 
	
	Если МассивМесяцев.Количество() = 0 Тогда
		Закрыть();	
	КонецЕсли; 
	
	МассивСтруктурПараметровЗакрытияМесяца = Новый Массив;
	
	Для каждого ЗакрываемыйМесяц Из МассивМесяцев Цикл
		
		МассивСтруктурПараметровЗакрытияМесяца.Добавить(ПолучитьСтруктуруПараметровНаСервере(ЗакрываемыйМесяц, НачалоГода(ЗакрываемыйМесяц)));	
		
	КонецЦикла;
	
	Закрыть(МассивСтруктурПараметровЗакрытияМесяца);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПолучитьСтруктуруПараметровНаСервере(ДатаМесяц, ДатаГод)
	
	ТекМесяц = СтроковыеФункцииКлиентСервер.СтрокаВЧисло(Строка(Формат(ДатаМесяц, "ДФ=MM")));
	ТекГод = СтроковыеФункцииКлиентСервер.СтрокаВЧисло(Строка(Формат(ДатаМесяц, "ДФ=yyyy")));
	
	СтруктураПараметров = Новый Структура;
	
	СтруктураПараметров.Вставить("ТекМесяц", 	ТекМесяц);
	СтруктураПараметров.Вставить("ТекГод", 		ТекГод);
	СтруктураПараметров.Вставить("Организация", Организация);
	
	ВыполнитьРасчетАмортизации = ЭтаФорма["НачислениеАмортизации1"];
	СтруктураПараметров.Вставить("ВыполнитьРасчетАмортизации", ВыполнитьРасчетАмортизации);
	
	// Заполним массив операций, по которым необходимо выполнить закрытие месяца
	МассивОпераций = Новый Массив;
	
	Если ЭтаФорма["РасчетПрямыхЗатрат1"] Тогда
		
		МассивОпераций.Добавить("РасчетПрямыхЗатрат");
		
	КонецЕсли;
	
	Если ЭтаФорма["РаспределениеЗатрат1"] Тогда
		
		МассивОпераций.Добавить("РаспределениеЗатрат");
		
	КонецЕсли;
	
	Если ЭтаФорма["РасчетФактическойСебестоимости1"] Тогда
		
		МассивОпераций.Добавить("РасчетФактическойСебестоимости");
		
	КонецЕсли;
	
	Если ЭтаФорма["РасчетСебестоимостиВРознице1"] Тогда
		
		МассивОпераций.Добавить("РасчетСебестоимостиВРозницеСуммовойУчет");
		
	КонецЕсли;
	
	Если ЭтаФорма["РасчетКурсовыхРазниц1"] Тогда
		
		МассивОпераций.Добавить("РасчетКурсовыхРазниц");
		
	КонецЕсли;
	
	Если ЭтаФорма["РасчетФинансовогоРезультата1"] Тогда
		
		МассивОпераций.Добавить("РасчетФинансовогоРезультата");
		
	КонецЕсли;
	
	СтруктураПараметров.Вставить("МассивОпераций", МассивОпераций);
	
	Возврат СтруктураПараметров;
	
КонецФункции 

#КонецОбласти


