#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
     	
#Область ПрограммныйИнтерфейс

&ИзменениеИКонтроль("ИнициализироватьДанныеДокумента")
Процедура пр_ИнициализироватьДанныеДокумента(ДокументСсылкаАвансовыйОтчет, СтруктураДополнительныеСвойства)

	Запрос = Новый Запрос();
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;

	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаАвансовыйОтчет);
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.Дляпроведения.Организация);
	Запрос.УстановитьПараметр("ИспользоватьХарактеристики", СтруктураДополнительныеСвойства.УчетнаяПолитика.ИспользоватьХарактеристики);
	Запрос.УстановитьПараметр("ИспользоватьПартии", СтруктураДополнительныеСвойства.УчетнаяПолитика.ИспользоватьПартии);
	Запрос.УстановитьПараметр("ОприходованиеЗапасов", НСтр("ru = 'Оприходование запасов'"));
	Запрос.УстановитьПараметр("ПрочиеРасходы", НСтр("ru = 'Отражение затрат'"));
	Запрос.УстановитьПараметр("КассовыйМетодУчетаДоходовИРасходов", СтруктураДополнительныеСвойства.УчетнаяПолитика.КассовыйМетодУчетаДоходовИРасходов);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаДокумента.НомерСтроки КАК НомерСтроки,
	|	ТаблицаДокумента.Документ.Статья КАК Статья
	|ИЗ
	|	Документ.АвансовыйОтчет.ВыданныеАвансы КАК ТаблицаДокумента
	|ГДЕ
	|	ТаблицаДокумента.Ссылка = &Ссылка
	|	И &КассовыйМетодУчетаДоходовИРасходов
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";

	РезультатЗапроса = Запрос.Выполнить().Выбрать();

	Если РезультатЗапроса.Следующий() Тогда
		Статья = РезультатЗапроса.Статья;
	Иначе
		Статья = Справочники.СтатьиДвиженияДенежныхСредств.ОплатаПоставщикам;
	КонецЕсли;

	Запрос.УстановитьПараметр("Статья", Статья);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	МАКСИМУМ(ТаблицаДокумента.НомерСтроки) КАК НомерСтроки,
	|	ТаблицаДокумента.Ссылка.Дата КАК Период,
	|	&Организация КАК Организация,
	|	ТаблицаДокумента.Контрагент КАК Контрагент,
	|	ТаблицаДокумента.Контрагент.ВестиРасчетыПоДоговорам КАК ВестиРасчетыПоДоговорам,
	|	ТаблицаДокумента.Контрагент.ВестиРасчетыПоДокументам КАК ВестиРасчетыПоДокументам,
	|	ТаблицаДокумента.Контрагент.ВестиРасчетыПоЗаказам КАК ВестиРасчетыПоЗаказам,
	|	ТаблицаДокумента.Контрагент.ВестиУчетОплатыПоСчетам КАК ВестиУчетОплатыПоСчетам,
	|	ТаблицаДокумента.Ссылка.УчитыватьВНУ КАК УчитыватьВНУ,
	|	ТаблицаДокумента.Ссылка.Организация КАК ОрганизацияВНУ,
	|	ТаблицаДокумента.Ссылка.НалогообложениеНДС КАК НалогообложениеНДС,
	|	ТаблицаДокумента.Договор КАК Договор,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Договор.ЭтоДоговорОбслуживания
	|				И ТаблицаДокумента.Договор.ДоговорОбслуживанияНаправлениеДеятельности <> ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ВестиУчетРасходовПоДоговорамОбслуживания,
	|	ТаблицаДокумента.Договор.ДоговорОбслуживанияНаправлениеДеятельности КАК ДоговорОбслуживанияНаправлениеДеятельности,
	|	ТаблицаДокумента.Договор.ВалютаРасчетов КАК Валюта,
	|	ТаблицаДокумента.ПризнакАванса КАК ПризнакАванса,
	|	ТаблицаДокумента.Документ КАК Документ,
	|	ТаблицаДокумента.Ссылка.Сотрудник КАК Сотрудник,
	|	ТаблицаДокумента.Ссылка.ВалютаДокумента КАК ВалютаДокумента,
	|	ТаблицаДокумента.Ссылка.Сотрудник.СчетРасчетовПоПерерасходу КАК СчетРасчетовПоПерерасходу,
	|	ТаблицаДокумента.Ссылка.Сотрудник.СчетРасчетовСПодотчетниками КАК СчетРасчетовСПодотчетниками,
	|	ТаблицаДокумента.Контрагент.СчетУчетаРасчетовСПоставщиком КАК СчетУчетаРасчетовСПоставщиком,
	|	ТаблицаДокумента.Контрагент.СчетУчетаАвансовПоставщику КАК СчетУчетаАвансовПоставщику,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ПризнакАванса
	|			ТОГДА ТаблицаДокумента.Контрагент.СчетУчетаАвансовПоставщику
	|		ИНАЧЕ ТаблицаДокумента.Контрагент.СчетУчетаРасчетовСПоставщиком
	|	КОНЕЦ КАК СчетУчета,
	|	ТаблицаДокумента.Заказ КАК Заказ,
	|	ТаблицаДокумента.СчетНаОплату КАК СчетНаОплату,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СчетНаОплату.ЗапланироватьОплату
	|			ТОГДА ТаблицаДокумента.СчетНаОплату
	|		КОГДА ТаблицаДокумента.Заказ.ЗапланироватьОплату
	|			ТОГДА ТаблицаДокумента.Заказ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК СчетНаОплатуДляПлатежногоКалендаря,
	|	ТаблицаДокумента.Курс КАК Курс,
	|	ТаблицаДокумента.Кратность КАК Кратность,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Статья = ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ОплатаПоставщикам)
	|		ИНАЧЕ ТаблицаДокумента.Статья
	|	КОНЕЦ КАК Статья,
	|	СУММА(ТаблицаДокумента.СуммаПлатежа) КАК СуммаПлатежа,
	|	СУММА(ВЫРАЗИТЬ(ТаблицаДокумента.СуммаПлатежа * ТаблицаДокумента.Ссылка.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * ТаблицаДокумента.Ссылка.Кратность) КАК ЧИСЛО(15, 2))) КАК Сумма,
	|	СУММА(ТаблицаДокумента.СуммаРасчетов) КАК СуммаВал
	|ПОМЕСТИТЬ ВременнаяТаблицаОплаты
	|ИЗ
	|	Документ.АвансовыйОтчет.Оплаты КАК ТаблицаДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
	|				&МоментВремени,
	|				Валюта В
	|					(ВЫБРАТЬ
	|						Константы.ВалютаУчета
	|					ИЗ
	|						Константы КАК Константы)) КАК КурсыВалютУчета
	|		ПО (ИСТИНА)
	|ГДЕ
	|	ТаблицаДокумента.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДокумента.Ссылка,
	|	ТаблицаДокумента.Контрагент,
	|	ТаблицаДокумента.Договор,
	|	ТаблицаДокумента.Договор.ВалютаРасчетов,
	|	ТаблицаДокумента.ПризнакАванса,
	|	ТаблицаДокумента.Документ,
	|	ТаблицаДокумента.Заказ,
	|	ТаблицаДокумента.СчетНаОплату,
	|	ТаблицаДокумента.Курс,
	|	ТаблицаДокумента.Кратность,
	|	ТаблицаДокумента.Статья,
	|	ТаблицаДокумента.Ссылка.Дата,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Заказ = ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ТаблицаДокумента.Заказ
	|	КОНЕЦ,
	|	ТаблицаДокумента.Ссылка.Сотрудник.СчетРасчетовПоПерерасходу,
	|	ТаблицаДокумента.Ссылка.Сотрудник.СчетРасчетовСПодотчетниками,
	|	ТаблицаДокумента.Ссылка.Сотрудник,
	|	ТаблицаДокумента.Контрагент.СчетУчетаРасчетовСПоставщиком,
	|	ТаблицаДокумента.Контрагент.СчетУчетаАвансовПоставщику,
	|	ТаблицаДокумента.Ссылка.ВалютаДокумента,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СчетНаОплату.ЗапланироватьОплату
	|			ТОГДА ТаблицаДокумента.СчетНаОплату
	|		КОГДА ТаблицаДокумента.Заказ.ЗапланироватьОплату
	|			ТОГДА ТаблицаДокумента.Заказ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ТаблицаДокумента.Контрагент.ВестиРасчетыПоДоговорам,
	|	ТаблицаДокумента.Контрагент.ВестиРасчетыПоДокументам,
	|	ТаблицаДокумента.Контрагент.ВестиРасчетыПоЗаказам,
	|	ТаблицаДокумента.Контрагент.ВестиУчетОплатыПоСчетам,
	|	ТаблицаДокумента.Договор.ДоговорОбслуживанияНаправлениеДеятельности,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Договор.ЭтоДоговорОбслуживания
	|				И ТаблицаДокумента.Договор.ДоговорОбслуживанияНаправлениеДеятельности <> ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АвансовыйОтчетЗапасы.НомерСтроки КАК НомерСтроки,
	|	АвансовыйОтчетЗапасы.Период КАК Период,
	|	АвансовыйОтчетЗапасы.Организация КАК Организация,
	|	АвансовыйОтчетЗапасы.УчитыватьВНУ КАК УчитыватьВНУ,
	|	АвансовыйОтчетЗапасы.ОрганизацияВНУ КАК ОрганизацияВНУ,
	|	АвансовыйОтчетЗапасы.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	АвансовыйОтчетЗапасы.СтруктурнаяЕдиница.ОрдерныйСклад КАК ОрдерныйСклад,
	|	АвансовыйОтчетЗапасы.Ячейка КАК Ячейка,
	|	АвансовыйОтчетЗапасы.СчетУчета КАК СчетУчета,
	|	АвансовыйОтчетЗапасы.Номенклатура КАК Номенклатура,
	|	АвансовыйОтчетЗапасы.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	АвансовыйОтчетЗапасы.Сотрудник КАК Сотрудник,
	|	АвансовыйОтчетЗапасы.Валюта КАК Валюта,
	|	АвансовыйОтчетЗапасы.СчетРасчетовСПодотчетниками КАК СчетРасчетовСПодотчетниками,
	|	АвансовыйОтчетЗапасы.СчетРасчетовПоПерерасходу КАК СчетРасчетовПоПерерасходу,
	|	АвансовыйОтчетЗапасы.Характеристика КАК Характеристика,
	|	АвансовыйОтчетЗапасы.Партия КАК Партия,
	|	АвансовыйОтчетЗапасы.ЗаказПокупателя КАК ЗаказПокупателя,
	|	АвансовыйОтчетЗапасы.Количество КАК Количество,
	|	АвансовыйОтчетЗапасы.Сумма КАК Сумма,
	|	АвансовыйОтчетЗапасы.СуммаВал КАК СуммаВал,
	|	АвансовыйОтчетЗапасы.СуммаНДС КАК СуммаНДС,
	|	АвансовыйОтчетЗапасы.СтавкаНДС КАК СтавкаНДС,
	|	АвансовыйОтчетЗапасы.СуммаНДСЗакупки КАК СуммаНДСЗакупки,
	|	АвансовыйОтчетЗапасы.СуммаНДСВал КАК СуммаНДСВал,
	|	ВЫБОР
	|		КОГДА АвансовыйОтчетЗапасы.Статья = ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка)
	|			ТОГДА &Статья
	|		ИНАЧЕ АвансовыйОтчетЗапасы.Статья
	|	КОНЕЦ КАК Статья,
	|	АвансовыйОтчетЗапасы.ТоварыДляПроизводства КАК ТоварыДляПроизводства,
	|	&Ссылка КАК Документ
	|ПОМЕСТИТЬ ВременнаяТаблицаЗапасы
	|ИЗ
	|	(ВЫБРАТЬ
	|		АвансовыйОтчетЗапасы.НомерСтроки КАК НомерСтроки,
	|		АвансовыйОтчетЗапасы.Ссылка.Дата КАК Период,
	|		&Организация КАК Организация,
	|		АвансовыйОтчетЗапасы.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|		АвансовыйОтчетЗапасы.Ячейка КАК Ячейка,
	|		АвансовыйОтчетЗапасы.Номенклатура.СчетУчетаЗапасов КАК СчетУчета,
	|		АвансовыйОтчетЗапасы.Номенклатура.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		АвансовыйОтчетЗапасы.Номенклатура КАК Номенклатура,
	|		АвансовыйОтчетЗапасы.Ссылка.Сотрудник КАК Сотрудник,
	|		АвансовыйОтчетЗапасы.Ссылка.УчитыватьВНУ КАК УчитыватьВНУ,
	|		АвансовыйОтчетЗапасы.Ссылка.Организация КАК ОрганизацияВНУ,
	|		АвансовыйОтчетЗапасы.СтавкаНДС КАК СтавкаНДС,
	|		АвансовыйОтчетЗапасы.Ссылка.ВалютаДокумента КАК Валюта,
	|		АвансовыйОтчетЗапасы.Ссылка.Сотрудник.СчетРасчетовПоПерерасходу КАК СчетРасчетовПоПерерасходу,
	|		АвансовыйОтчетЗапасы.Ссылка.Сотрудник.СчетРасчетовСПодотчетниками КАК СчетРасчетовСПодотчетниками,
	|		АвансовыйОтчетЗапасы.ЗаказПокупателя КАК ЗаказПокупателя,
	|		ВЫБОР
	|			КОГДА &ИспользоватьХарактеристики
	|				ТОГДА АвансовыйОтчетЗапасы.Характеристика
	|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|		КОНЕЦ КАК Характеристика,
	|		ВЫБОР
	|			КОГДА &ИспользоватьПартии
	|				ТОГДА АвансовыйОтчетЗапасы.Партия
	|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПартииНоменклатуры.ПустаяСсылка)
	|		КОНЕЦ КАК Партия,
	|		ВЫБОР
	|			КОГДА ТИПЗНАЧЕНИЯ(АвансовыйОтчетЗапасы.ЕдиницаИзмерения) = ТИП(Справочник.КлассификаторЕдиницИзмерения)
	|				ТОГДА АвансовыйОтчетЗапасы.Количество
	|			ИНАЧЕ АвансовыйОтчетЗапасы.Количество * АвансовыйОтчетЗапасы.ЕдиницаИзмерения.Коэффициент
	|		КОНЕЦ КАК Количество,
	|		ВЫБОР
	|			КОГДА АвансовыйОтчетЗапасы.Ссылка.НДСВключатьВСтоимость
	|				ТОГДА 0
	|			ИНАЧЕ АвансовыйОтчетЗапасы.СуммаНДС
	|		КОНЕЦ КАК СуммаНДСВал,
	|		ВЫБОР
	|			КОГДА АвансовыйОтчетЗапасы.Ссылка.НДСВключатьВСтоимость
	|				ТОГДА 0
	|			ИНАЧЕ ВЫРАЗИТЬ(АвансовыйОтчетЗапасы.СуммаНДС * АвансовыйОтчетЗапасы.Ссылка.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * АвансовыйОтчетЗапасы.Ссылка.Кратность) КАК ЧИСЛО(15, 2))
	|		КОНЕЦ КАК СуммаНДС,
	|		ВЫРАЗИТЬ(АвансовыйОтчетЗапасы.СуммаНДС * АвансовыйОтчетЗапасы.Ссылка.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * АвансовыйОтчетЗапасы.Ссылка.Кратность) КАК ЧИСЛО(15, 2)) КАК СуммаНДСЗакупки,
	|		АвансовыйОтчетЗапасы.Всего КАК СуммаВал,
	|		ВЫРАЗИТЬ(АвансовыйОтчетЗапасы.Всего * АвансовыйОтчетЗапасы.Ссылка.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * АвансовыйОтчетЗапасы.Ссылка.Кратность) КАК ЧИСЛО(15, 2)) КАК Сумма,
	|		АвансовыйОтчетЗапасы.Статья КАК Статья,
	|		АвансовыйОтчетЗапасы.ТоварыДляПроизводства КАК ТоварыДляПроизводства,
	|		&ОприходованиеЗапасов КАК СодержаниеПроводки
	|	ИЗ
	|		Документ.АвансовыйОтчет.Запасы КАК АвансовыйОтчетЗапасы
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
	|					&МоментВремени,
	|					Валюта В
	|						(ВЫБРАТЬ
	|							Константы.ВалютаУчета
	|						ИЗ
	|							Константы КАК Константы)) КАК КурсыВалютУчета
	|			ПО (ИСТИНА)
	|	ГДЕ
	|		АвансовыйОтчетЗапасы.Ссылка = &Ссылка) КАК АвансовыйОтчетЗапасы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АвансовыйОтчетРасходы.НомерСтроки КАК НомерСтроки,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	АвансовыйОтчетРасходы.Период КАК Период,
	|	АвансовыйОтчетРасходы.Организация КАК Организация,
	|	АвансовыйОтчетРасходы.ОрганизацияВНУ КАК ОрганизацияВНУ,
	|	АвансовыйОтчетРасходы.УчитыватьВНУ КАК УчитыватьВНУ,
	|	АвансовыйОтчетРасходы.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	АвансовыйОтчетРасходы.СчетУчета КАК СчетУчета,
	|	АвансовыйОтчетРасходы.Номенклатура КАК Номенклатура,
	|	АвансовыйОтчетРасходы.Сотрудник КАК Сотрудник,
	|	АвансовыйОтчетРасходы.Валюта КАК Валюта,
	|	АвансовыйОтчетРасходы.СчетРасчетовСПодотчетниками КАК СчетРасчетовСПодотчетниками,
	|	АвансовыйОтчетРасходы.СчетРасчетовПоПерерасходу КАК СчетРасчетовПоПерерасходу,
	|	АвансовыйОтчетРасходы.Характеристика КАК Характеристика,
	|	АвансовыйОтчетРасходы.Партия КАК Партия,
	|	АвансовыйОтчетРасходы.Количество КАК Количество,
	|	АвансовыйОтчетРасходы.ЗаказПокупателя КАК ЗаказПокупателя,
	|	АвансовыйОтчетРасходы.Сумма КАК Сумма,
	|	АвансовыйОтчетРасходы.СуммаВал КАК СуммаВал,
	|	АвансовыйОтчетРасходы.СтавкаНДС КАК СтавкаНДС,
	|	АвансовыйОтчетРасходы.СуммаНДС КАК СуммаНДС,
	|	АвансовыйОтчетРасходы.СуммаНДСВал КАК СуммаНДСВал,
	|	АвансовыйОтчетРасходы.СуммаНДСЗакупки КАК СуммаНДСЗакупки,
	|	АвансовыйОтчетРасходы.ТипСчетУчета КАК ТипСчетУчета,
	|	АвансовыйОтчетРасходы.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ВЫБОР
	|		КОГДА АвансовыйОтчетРасходы.Статья = ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка)
	|			ТОГДА &Статья
	|		ИНАЧЕ АвансовыйОтчетРасходы.Статья
	|	КОНЕЦ КАК Статья,
	|	ИСТИНА КАК ФиксированнаяСтоимость,
	|	&Ссылка КАК Документ
	|ПОМЕСТИТЬ ВременнаяТаблицаРасходы
	|ИЗ
	|	(ВЫБРАТЬ
	|		АвансовыйОтчетРасходы.НомерСтроки КАК НомерСтроки,
	|		АвансовыйОтчетРасходы.Ссылка.Дата КАК Период,
	|		&Организация КАК Организация,
	|		АвансовыйОтчетРасходы.Ссылка.УчитыватьВНУ КАК УчитыватьВНУ,
	|		АвансовыйОтчетРасходы.Ссылка.Организация КАК ОрганизацияВНУ,
	|		АвансовыйОтчетРасходы.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|		АвансовыйОтчетРасходы.Номенклатура.СчетУчетаЗатрат КАК СчетУчета,
	|		АвансовыйОтчетРасходы.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		АвансовыйОтчетРасходы.Номенклатура КАК Номенклатура,
	|		АвансовыйОтчетРасходы.СтавкаНДС КАК СтавкаНДС,
	|		АвансовыйОтчетРасходы.Ссылка.Сотрудник КАК Сотрудник,
	|		АвансовыйОтчетРасходы.Ссылка.ВалютаДокумента КАК Валюта,
	|		АвансовыйОтчетРасходы.Ссылка.Сотрудник.СчетРасчетовСПодотчетниками КАК СчетРасчетовСПодотчетниками,
	|		АвансовыйОтчетРасходы.Ссылка.Сотрудник.СчетРасчетовПоПерерасходу КАК СчетРасчетовПоПерерасходу,
	|		ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
	|		ЗНАЧЕНИЕ(Справочник.ПартииНоменклатуры.ПустаяСсылка) КАК Партия,
	|		ВЫБОР
	|			КОГДА ТИПЗНАЧЕНИЯ(АвансовыйОтчетРасходы.ЕдиницаИзмерения) = ТИП(Справочник.КлассификаторЕдиницИзмерения)
	|				ТОГДА АвансовыйОтчетРасходы.Количество
	|			ИНАЧЕ АвансовыйОтчетРасходы.Количество * АвансовыйОтчетРасходы.ЕдиницаИзмерения.Коэффициент
	|		КОНЕЦ КАК Количество,
	|		АвансовыйОтчетРасходы.ЗаказПокупателя КАК ЗаказПокупателя,
	|		ВЫБОР
	|			КОГДА АвансовыйОтчетРасходы.Ссылка.НДСВключатьВСтоимость
	|				ТОГДА 0
	|			ИНАЧЕ АвансовыйОтчетРасходы.СуммаНДС
	|		КОНЕЦ КАК СуммаНДСВал,
	|		ВЫБОР
	|			КОГДА АвансовыйОтчетРасходы.Ссылка.НДСВключатьВСтоимость
	|				ТОГДА 0
	|			ИНАЧЕ ВЫРАЗИТЬ(АвансовыйОтчетРасходы.СуммаНДС * АвансовыйОтчетРасходы.Ссылка.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * АвансовыйОтчетРасходы.Ссылка.Кратность) КАК ЧИСЛО(15, 2))
	|		КОНЕЦ КАК СуммаНДС,
	|		ВЫРАЗИТЬ(АвансовыйОтчетРасходы.СуммаНДС * АвансовыйОтчетРасходы.Ссылка.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * АвансовыйОтчетРасходы.Ссылка.Кратность) КАК ЧИСЛО(15, 2)) КАК СуммаНДСЗакупки,
	|		АвансовыйОтчетРасходы.Всего КАК СуммаВал,
	|		АвансовыйОтчетРасходы.Статья КАК Статья,
	|		ВЫРАЗИТЬ(АвансовыйОтчетРасходы.Всего * АвансовыйОтчетРасходы.Ссылка.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * АвансовыйОтчетРасходы.Ссылка.Кратность) КАК ЧИСЛО(15, 2)) КАК Сумма,
	|		АвансовыйОтчетРасходы.Номенклатура.СчетУчетаЗатрат.ТипСчета КАК ТипСчетУчета
	|	ИЗ
	|		Документ.АвансовыйОтчет.Расходы КАК АвансовыйОтчетРасходы
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
	|					&МоментВремени,
	|					Валюта В
	|						(ВЫБРАТЬ
	|							Константы.ВалютаУчета
	|						ИЗ
	|							Константы КАК Константы)) КАК КурсыВалютУчета
	|			ПО (ИСТИНА)
	|	ГДЕ
	|		АвансовыйОтчетРасходы.Ссылка = &Ссылка) КАК АвансовыйОтчетРасходы";

	#Вставка 
	// Изменения предназначены для замены получения СчетаЗатрат из номенклатуры на СчетЗатрат из таблично части.
	ЗаменяемаяСтрока = "АвансовыйОтчетРасходы.Номенклатура.СчетУчетаЗатрат";
	ИзмененнаяСтрока = "ВЫРАЗИТЬ(ВЫБОР КОГДА АвансовыйОтчетРасходы.СчетЗатрат = ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПустаяСсылка) Тогда АвансовыйОтчетРасходы.Номенклатура.СчетУчетаЗатрат ИНАЧЕ АвансовыйОтчетРасходы.СчетЗатрат КОНЕЦ КАК ПланСчетов.Управленческий)";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, ЗаменяемаяСтрока, ИзмененнаяСтрока); 
	
	#КонецВставки
	Запрос.ВыполнитьПакет();

	СформироватьТаблицаЗапасы(ДокументСсылкаАвансовыйОтчет, СтруктураДополнительныеСвойства);
	СформироватьТаблицаЗапасыНаСкладах(ДокументСсылкаАвансовыйОтчет, СтруктураДополнительныеСвойства);
	СформироватьТаблицаЗапасыКПоступлениюНаСклады(ДокументСсылкаАвансовыйОтчет, СтруктураДополнительныеСвойства);
	СформироватьТаблицаРасчетыСПоставщиками(ДокументСсылкаАвансовыйОтчет, СтруктураДополнительныеСвойства);
	СформироватьТаблицаРасчетыСПодотчетниками(ДокументСсылкаАвансовыйОтчет, СтруктураДополнительныеСвойства);
	СформироватьТаблицаДоходыИРасходы(ДокументСсылкаАвансовыйОтчет, СтруктураДополнительныеСвойства);
	СформироватьТаблицаДоходыИРасходыНераспределенные(ДокументСсылкаАвансовыйОтчет, СтруктураДополнительныеСвойства);
	СформироватьТаблицаДоходыИРасходыОтложенные(ДокументСсылкаАвансовыйОтчет, СтруктураДополнительныеСвойства);
	СформироватьТаблицаДоходыИРасходыКассовыйМетод(ДокументСсылкаАвансовыйОтчет, СтруктураДополнительныеСвойства);
	СформироватьТаблицаЗакупки(ДокументСсылкаАвансовыйОтчет, СтруктураДополнительныеСвойства);
	СформироватьТаблицаОплатаСчетовИЗаказов(ДокументСсылкаАвансовыйОтчет, СтруктураДополнительныеСвойства);
	СформироватьТаблицаПлатежныйКалендарь(ДокументСсылкаАвансовыйОтчет, СтруктураДополнительныеСвойства);
	СформироватьТаблицаУправленческий(ДокументСсылкаАвансовыйОтчет, СтруктураДополнительныеСвойства);
	СформироватьТаблицаЗакупкиДляКУДиР(ДокументСсылкаАвансовыйОтчет, СтруктураДополнительныеСвойства);
	СформироватьТаблицаОплатаДокументов(ДокументСсылкаАвансовыйОтчет, СтруктураДополнительныеСвойства);

КонецПроцедуры

#КонецОбласти 	
	
#КонецЕсли 


