#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
     	
#Область ОбработчикиСобытий

&Перед("ПередЗаписью")
Процедура пр_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОтражатьВУправленческомУчете и НЕ ОтражатьВБухгалтерскомУчете Тогда
		Организация = Справочники.Организации.ОсновнаяОрганизация;	
	КонецЕсли; 
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;	
	КонецЕсли; 
	
	Для каждого СтрокаРасходы Из Расходы Цикл
		
		Если НЕ ЗначениеЗаполнено(СтрокаРасходы.СчетЗатрат) И ЗначениеЗаполнено(СтрокаРасходы.Номенклатура) Тогда
			
			СтрокаРасходы.СчетЗатрат = пр_ПереходНаУНФВызовСервера.СчетУчетаЗатратНоменклатуры(СтрокаРасходы.Номенклатура);	
			
		КонецЕсли;
		
	КонецЦикла;  
	
КонецПроцедуры

&Перед("ПриКопировании")
Процедура пр_ПриКопировании(ОбъектКопирования)
	
	ОтражатьВБухгалтерскомУчете 	= Ложь;	
	ОтражатьВУправленческомУчете 	= Ложь;
	
КонецПроцедуры

&Вместо("ОбработкаПроведения")
Процедура пр_ОбработкаПроведения(Отказ, РежимПроведения)
	
	// переопределение методов проведения документа для загруженных из УПП документов
	Если НЕ ОтражатьВУправленческомУчете И ОтражатьВБухгалтерскомУчете Тогда
		пр_ПереопределенноеПроведениеДокумента(Отказ, РежимПроведения);
	Иначе
		ПродолжитьВызов(Отказ, РежимПроведения);
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти  

#Область СлужебныеПроцедурыИФункции

Процедура пр_ПереопределенноеПроведениеДокумента(Отказ, РежимПроведения)
	
	// Инициализация дополнительных свойств для проведения документа.
	УправлениеНебольшойФирмойСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей.
	УправлениеНебольшойФирмойСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Запись наборов записей.
	УправлениеНебольшойФирмойСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);

	ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц.Закрыть();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли 
