
&Вместо("ПолучитьПредставлениеЗаказа")
Функция пр_ПолучитьПредставлениеЗаказа(ТекущаяСтрока, ФормироватьПоДвижениям, Шрифт, ВыводитьЗаголовок, пЗаказ)
	
	Если пЗаказ = Неопределено Тогда
		ТекущийЗаказ = ТекущаяСтрока.Заказ;
	Иначе
		ТекущийЗаказ = пЗаказ;
	КонецЕсли;

	Если ТипЗнч(ТекущийЗаказ) = Тип("СправочникСсылка.франПериоды") Тогда
		Результат = пр_ПолучитьПредставлениеЗаказаВместо(ТекущаяСтрока, ФормироватьПоДвижениям, Шрифт, ВыводитьЗаголовок, пЗаказ);
	Иначе
		Результат = ПродолжитьВызов(ТекущаяСтрока, ФормироватьПоДвижениям, Шрифт, ВыводитьЗаголовок, пЗаказ);
	КонецЕсли; 
	
	Возврат Результат;
	
КонецФункции

Функция пр_ПолучитьПредставлениеЗаказаВместо(ТекущаяСтрока, ФормироватьПоДвижениям, Шрифт, ВыводитьЗаголовок = Ложь, пЗаказ = Неопределено)
	
	КомпонентыФС = Новый Массив;
	
	Если пЗаказ = Неопределено Тогда
		ТекущийЗаказ = ТекущаяСтрока.Заказ;
	Иначе
		ТекущийЗаказ = пЗаказ;
	КонецЕсли;
	
	Если ТекущаяСтрока.СпособЗачета <> Перечисления.СпособыЗачетаИРаспределенияПлатежей.Авто ИЛИ ФормироватьПоДвижениям Тогда
		
		Если ЗначениеЗаполнено(ТекущийЗаказ) Тогда
			Если ВыводитьЗаголовок Тогда
				КомпонентыФС.Добавить(Новый ФорматированнаяСтрока(НСтр("ru='Период '"), Шрифт));//+ТипЗнч(ТекущийЗаказ), ШрифтНомера));
			КонецЕсли;
			
			СтрокаНомерДата = Строка(ТекущийЗаказ);
			КомпонентыФС.Добавить(Новый ФорматированнаяСтрока(СтрокаНомерДата,,,, "Период"));
		Иначе
			Если ВыводитьЗаголовок Тогда
				КомпонентыФС.Добавить(Новый ФорматированнаяСтрока(НСтр("ru='Период '"), Шрифт));
			КонецЕсли;
			
			Надпись = ""; //НСтр("ru='<не указан>'");
			КомпонентыФС.Добавить(Новый ФорматированнаяСтрока(Надпись));
		КонецЕсли;
		
	Иначе
		
		Надпись = ""; //НСтр("ru='<не указан>'");
		КомпонентыФС.Добавить(Новый ФорматированнаяСтрока(Надпись, Шрифт));
		
	КонецЕсли;
	
	Надпись = Новый ФорматированнаяСтрока(КомпонентыФС, , ЦветаСтиля.ТекстВторостепеннойНадписи);
	
	Возврат Надпись;
	
КонецФункции
