
#Область ПрограммныйИнтерфейс

#Область УправлениеПроведением

&Перед("ЗаписатьНаборыЗаписей")
Процедура пр_ЗаписатьНаборыЗаписей(СтруктураОбъект)
	
	// Для совместимости далее вызываемых методов
	Отказ = Ложь;
	
	Если ТипЗнч(СтруктураОбъект) = Тип("ДокументОбъект.РасходнаяНакладная") 
		ИЛИ ТипЗнч(СтруктураОбъект) = Тип("ДокументОбъект.ПриходнаяНакладная") Тогда
		
		
		Если СтруктураОбъект.ДополнительныеСвойства.ТаблицыДляДвижений.Свойство("Таблицапр_НачисленныеБаллы") Тогда
			УправлениеНебольшойФирмойСервер.ОтразитьДвижения(СтруктураОбъект.ДополнительныеСвойства, СтруктураОбъект.Движения, 
				Отказ, "пр_НачисленныеБаллы");
		КонецЕсли; 
		
		Если СтруктураОбъект.ДополнительныеСвойства.ТаблицыДляДвижений.Свойство("ТаблицапрНапоминанияОПродажах") Тогда
			УправлениеНебольшойФирмойСервер.ОтразитьДвижения(СтруктураОбъект.ДополнительныеСвойства, СтруктураОбъект.Движения, 
				Отказ, "прНапоминанияОПродажах");
		КонецЕсли; 
		
		Если СтруктураОбъект.ДополнительныеСвойства.ТаблицыДляДвижений.Свойство("ТаблицафранПрограммныеПродуктыКонтрагентов") Тогда
			УправлениеНебольшойФирмойСервер.ОтразитьДвижения(СтруктураОбъект.ДополнительныеСвойства, СтруктураОбъект.Движения, 
				Отказ, "франПрограммныеПродуктыКонтрагентов");
		КонецЕсли; 
		
	ИначеЕсли ТипЗнч(СтруктураОбъект) = Тип("ДокументОбъект.ПриемНаРаботу") 
		ИЛИ ТипЗнч(СтруктураОбъект) = Тип("ДокументОбъект.КадровоеПеремещение") Тогда	
		
		Если СтруктураОбъект.ДополнительныеСвойства.ТаблицыДляДвижений.Свойство("ТаблицаПоказателиKPI") Тогда
			УправлениеНебольшойФирмойСервер.ОтразитьДвижения(СтруктураОбъект.ДополнительныеСвойства, СтруктураОбъект.Движения, 
				Отказ, "ПоказателиKPI");
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти 

#КонецОбласти 

