#Область ОбработчикиСобытийФормы

&НаСервере
Процедура пр_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	пр_СоздатьФранРеквизитыФормы(); 	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура пр_СоздатьФранРеквизитыФормы()
		
	пр_СоздатьЭлементФормы("пр_КонтролироватьМинимумЧасовПрошлогоДня", ЭтаФорма, 
		"Объект.пр_КонтролироватьМинимумЧасовПрошлогоДня", "Контролировать минимум часов прошлого дня");

КонецПроцедуры

&НаСервере
Процедура пр_СоздатьЭлементФормы(ИмяЭлемента, ГруппаФормы, ПутьКДанным, ЗаголовокЭлемента)
	
	Если Элементы.Найти(ИмяЭлемента) = Неопределено Тогда
		
		ЭлементФормы = Элементы.Вставить(ИмяЭлемента, Тип("ПолеФормы"), ГруппаФормы, Элементы.ДополнительныеРеквизиты);  
		
		ЭлементФормы.Вид 			= ВидПоляФормы.ПолеФлажка;
		ЭлементФормы.ПутьКДанным 	= ПутьКДанным;
		ЭлементФормы.Заголовок 		= ЗаголовокЭлемента;
		
	КонецЕсли;   
		
КонецПроцедуры

#КонецОбласти
  
