#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Аннотация не требуется, см. имя метода
//
// Параметры:
//   Контрагент - СправочникСсылка.Контрагенты
//    
// Возвращаемое значение:
//  Доступность1СКоннект - Булево
// 
Функция пр_КонтрагентуДоступен1СКоннект(Контрагент) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Т1.Идентификатор КАК Идентификатор
		|ИЗ
		|	РегистрСведений.эсКоннектСоответствиеКлиентовКонтрагентам КАК Т1
		|ГДЕ
		|	Т1.Контрагент = &Контрагент";
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат НЕ РезультатЗапроса.Пустой();
	
КонецФункции   

#КонецОбласти 	
	
#КонецЕсли 

