#Область ОбработчикиСобытийФормы

&НаСервере
Процедура пр_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	пр_УправлениеЭлементамиФормы();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура пр_УправлениеЭлементамиФормы()
	
	// Создание основной группы для горизонтального размещения списка и его реквизитов
	КонтекстГруппы = РедакторФорм.СоздатьКонтекстЭлемента(ЭтаФорма, ЭтаФорма, Элементы.Список);
	
	ГруппаСписок = РедакторФорм.ДобавитьГруппуНаФорму(КонтекстГруппы, "пр_ГруппаСписок");
	ГруппаСписок.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаСписок.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	ГруппаСписок.Отображатьзаголовок = Ложь;

	Элементы.Переместить(Элементы.Список, ГруппаСписок);
	
	// Группа реквизитов, правее списка
	КонтекстГруппыРеквизитов = РедакторФорм.СоздатьКонтекстЭлемента(ЭтаФорма, ГруппаСписок);
	
	ГруппаРеквизитов = РедакторФорм.ДобавитьГруппуНаФорму(КонтекстГруппыРеквизитов, "пр_ГруппаРеквизиты");
	ГруппаРеквизитов.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаРеквизитов.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	ГруппаРеквизитов.Отображатьзаголовок = Ложь;
	
	// Размещение полей Содержание и Результат
	КонтекстПолей = РедакторФорм.СоздатьКонтекстЭлемента(ЭтаФорма, ГруппаРеквизитов);
	
	ПолеСодержание = РедакторФорм.ДобавитьПолеНаФорму(КонтекстПолей, "пр_Содержание");
	ПолеСодержание.ПутьКДанным 			= "Элементы.Список.ТекущиеДанные.Содержание";
	ПолеСодержание.МногострочныйРежим 	= Истина;
	
	ПолеРезультат = РедакторФорм.ДобавитьПолеНаФорму(КонтекстПолей, "пр_Результат");
	ПолеРезультат.ПутьКДанным 			= "Элементы.Список.ТекущиеДанные.Результат";
	ПолеРезультат.МногострочныйРежим 	= Истина;
	
КонецПроцедуры

#КонецОбласти

