#Область ПрограммныйИнтерфейс

Процедура УправлениеВидимостьюДополнительныхЭлементовФормыКадровогоДокумена(Форма) Экспорт
	
	ВидимостьЭлементов = Форма.пр_ОтображатьДополнительныеКолонки;
	
	Форма.Элементы.пр_ГруппаКолонокГрейд.Видимость 		= ВидимостьЭлементов;
	Форма.Элементы.пр_ГруппаКолонокНормаЧасов.Видимость = ВидимостьЭлементов;
	Форма.Элементы.пр_ГруппаКолонокОклад.Видимость 		= ВидимостьЭлементов;
	Форма.Элементы.пр_ГруппаКолонокПремия.Видимость 	= ВидимостьЭлементов;
	Форма.Элементы.пр_ГруппаКолонокКоэффицент.Видимость = ВидимостьЭлементов;
	Форма.Элементы.пр_ГруппаКолонокКонтроль.Видимость 	= ВидимостьЭлементов;

	Форма.Элементы.Сотрудникипр_ПоказатьСкрытьДополнительныеРеквизиты.ЦветФона = 
		?(ВидимостьЭлементов, WebЦвета.СветлоЖелтый, Форма.Элементы.Сотрудники.ЦветФона);
	
КонецПроцедуры

#КонецОбласти
