#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
     	
#Область ОбработчикиСобытий

&После("ОбработкаПроверкиЗаполнения")
Процедура пр_ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если пр_ОповещатьКлиентаОПревышенииЧасов Тогда
		ПроверяемыеРеквизиты.Добавить("пр_КаналОповещения");
		ПроверяемыеРеквизиты.Добавить("пр_ПредставлениеКаналаОповещения");
		ПроверяемыеРеквизиты.Добавить("пр_КритическоеКоличествоЧасовДляОповещения");
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли 
