#Область ОбработчикиСобытийФормы

&НаСервере
Процедура пр_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	пр_УправлениеЭлементамиФормы();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыРасходы

&НаКлиенте
Процедура пр_РасходыПриИзмененииПосле(Элемент)
	
	ТекущиеДанные = Элементы.Расходы.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда 	
		Возврат;
	КонецЕсли; 
	
	Если НЕ ЗначениеЗаполнено(ТекущиеДанные.СчетЗатрат) И ЗначениеЗаполнено(ТекущиеДанные.Номенклатура) Тогда
		
		ТекущиеДанные.СчетЗатрат = пр_ПереходНаУНФВызовСервера.СчетУчетаЗатратНоменклатуры(ТекущиеДанные.Номенклатура);	
		
	КонецЕсли; 

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура пр_УправлениеЭлементамиФормы()
	
	// Добавление в табличную часть "Расходы" поля "СчетЗатрат"
	КонтекстПоля = РедакторФорм.СоздатьКонтекстЭлемента(ЭтаФорма, Элементы.Расходы);	
	КонтекстПоля.Свойства.Вставить("ПутьКДанным", 	"Объект.Расходы.СчетЗатрат");
	КонтекстПоля.Свойства.Вставить("Заголовок", 	"Счет затрат");
	КонтекстПоля.Свойства.Вставить("Доступность", 	Истина);
	
	ПолеФормы = РедакторФорм.ДобавитьПолеНаФорму(КонтекстПоля, "РасходыСчетЗатрат");
	
	// Группа ПР
	КонтекстГруппы = РедакторФорм.СоздатьКонтекстЭлемента(ЭтотОбъект, Элементы.ДополнительноЛеваяКолонка);
	КонтекстГруппы.Свойства.Вставить("Заголовок", "Простые решения");
	КонтекстГруппы.Свойства.Вставить("ОтображатьЗаголовок", Истина);
 	ГруппаРеквизитыПР = РедакторФорм.ДобавитьГруппуОбычную(КонтекстГруппы, "ГруппаПростыеРешения");
	
	// франДатаСдачи
	КонтекстПоля = РедакторФорм.СоздатьКонтекстЭлемента(ЭтотОбъект, ГруппаРеквизитыПР, ГруппаРеквизитыПР);	
	КонтекстПоля.Свойства.Вставить("ПутьКДанным", 	"Объект.франДатаСдачи");
	КонтекстПоля.Свойства.Вставить("Заголовок", 	"Дата сдачи");
	ПолеФормы = РедакторФорм.ДобавитьПолеНаФорму(КонтекстПоля, "франДатаСдачи");
	
	// франСдан
	КонтекстПоля = РедакторФорм.СоздатьКонтекстЭлемента(ЭтотОбъект, ГруппаРеквизитыПР, ГруппаРеквизитыПР);	
	КонтекстПоля.Свойства.Вставить("ПутьКДанным", 	"Объект.франСдан");
	КонтекстПоля.Свойства.Вставить("Заголовок", 	"Сдан");
	КонтекстПоля.Свойства.Вставить("Вид", 			ВидПоляФормы.ПолеФлажка);
	ПолеФормы = РедакторФорм.ДобавитьПолеНаФорму(КонтекстПоля, "франСдан");
	
	// переход с УПП
	пр_РаботаСФормами.пр_ДобавитьФлажкиПринадлежностиУчетовНаФорму(ЭтаФорма, Элементы.ДополнительноЛеваяКолонка);
		
КонецПроцедуры

#КонецОбласти

