#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

Процедура пр_ЗаполнитьНачисленияПоГрейдам() Экспорт
	
	НачисленияУдержания.Загрузить(пр_ЗаполнениеДокументов.ПолучитьТаблицуНачисленийПоГрейдамСотрудников(Ссылка));
	
КонецПроцедуры

#КонецОбласти
	
#Область ОбработчикиСобытий

&После("ОбработкаПроверкиЗаполнения")
Процедура пр_ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;	
	КонецЕсли; 
	
	Если Дата < Дата(2020, 1, 1) Тогда
		Возврат;	
	КонецЕсли; 

	ПроверяемыеРеквизиты.Добавить("Сотрудники.пр_НормаЧасовМаксимум");
	ПроверяемыеРеквизиты.Добавить("Сотрудники.пр_Оклад");
	ПроверяемыеРеквизиты.Добавить("Сотрудники.пр_ПремияЗаРезультат");
	ПроверяемыеРеквизиты.Добавить("Сотрудники.пр_Премия4Плюс");
	ПроверяемыеРеквизиты.Добавить("Сотрудники.пр_КоэффициентРабочегоВремениУменьшенный");
	ПроверяемыеРеквизиты.Добавить("Сотрудники.пр_КоэффициентРабочегоВремени");
	ПроверяемыеРеквизиты.Добавить("Сотрудники.пр_КоэффициентРабочегоВремениУвеличенный");
	
КонецПроцедуры

#КонецОбласти
	
#КонецЕсли

