
&Вместо("ОбъектПередЗаписью")
Процедура пр_ОбъектПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения)
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ТипИсточника = ТипЗнч(Источник);

	Если ТипИсточника = Тип("ДокументОбъект.Событие") Тогда
		
		// {[+](фрагмент ДОБАВЛЕН), Андрей К. 28.07.2020 12:49:29
		Если Не ЗначениеЗаполнено(Источник.Партнер) Тогда
		// }Андрей К. 28.07.2020 12:49:29 
			
			Если Источник.Участники.Количество() > 0 Тогда
				
				ПервыйУчастник = Источник.Участники[0].Контакт;
				
				Если ТипЗнч(ПервыйУчастник) = Тип("СправочникСсылка.Контрагенты") Тогда
					
					Источник.Партнер = ПервыйУчастник; 
					
				Иначе
					
					Источник.Партнер = Справочники.Контрагенты.ПустаяСсылка();
					
				КонецЕсли;	
					
			Иначе
				
				Источник.Партнер = Справочники.Контрагенты.ПустаяСсылка();			
					
			КонецЕсли;	
			
		// {[+](фрагмент ДОБАВЛЕН), Андрей К. 28.07.2020 12:49:36
		КонецЕсли; 
		// }Андрей К. 28.07.2020 12:49:36 	
		
		Возврат;
		
	КонецЕсли;
		
	ПродолжитьВызов(Источник, Отказ, РежимЗаписи, РежимПроведения);
	
КонецПроцедуры
