#Область ОбработчикиСобытийФормы

&НаСервере
Процедура пр_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	пр_ИзменитьРеквизитыФормы();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура пр_ИзменитьРеквизитыФормы()
	
	// Состояние
	КонтекстЭлемента = РедакторФорм.СоздатьКонтекстЭлемента(ЭтаФорма.Элементы.ГруппаРеквизиты, Элементы.НомерДата);
	ЭлементСостояние = РедакторФорм.ДобавитьПолеНаФормуРеквизитОбъекта(КонтекстЭлемента, "Состояние");
	
КонецПроцедуры

#КонецОбласти


