
&После("CRM_УНФ_ОбработкаПолученияФорм")
Процедура пр_CRM_УНФ_ОбработкаПолученияФорм(Источник, ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	#Область Событие
	Если ТипЗнч(Источник) = Тип("ДокументМенеджер.Событие") Тогда
		
		Если ВидФормы = "ФормаОбъекта" Тогда
			
			//Если Параметры.Свойство("Ключ") Тогда
				
				//Если ЗначениеЗаполнено(Параметры.Ключ.CRM_ВидСобытия) Тогда				
						
					ВыбраннаяФорма = "Документ.Событие.Форма.пр_CRM_ФормаДокумента";
					СтандартнаяОбработка = Ложь;
					
				//КонецЕсли;
				
			//КонецЕсли;			
			
		КонецЕсли;
		
	КонецЕсли;
	#КонецОбласти
	
КонецПроцедуры

