#Область ОбработчикиСобытийФормы

&НаСервере
Процедура пр_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	пр_ИзменениеЭлементовФормы();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура пр_ИзменениеЭлементовФормы()
	
	СвойстваЭлемента = Новый Структура;
	СвойстваЭлемента.Вставить("Заголовок", 				"Простые решения");
	СвойстваЭлемента.Вставить("ОтображатьЗаголовок", 	Истина);
	СвойстваЭлемента.Вставить("ЦветФона", 				WebЦвета.СветлоСерый);
	КонтекстГруппы = РедакторФорм.СоздатьКонтекстЭлемента(ЭтаФорма, ЭтаФорма, Элементы.СтраницаДополнительныеРеквизиты, СвойстваЭлемента);
		
	ГруппаПростыеРешения = РедакторФорм.ДобавитьГруппуОбычную(КонтекстГруппы, "пр_ГруппаПростыеРешения");
	
	КонтекстЭлемента = РедакторФорм.СоздатьКонтекстЭлемента(ЭтаФорма, ГруппаПростыеРешения);
	
	ЭлементСертификат 		= РедакторФорм.ДобавитьПолеНаФормуРеквизитОбъекта(КонтекстЭлемента, "Сертификат");
	ЭлементПодтверждение 	= РедакторФорм.ДобавитьПолеНаФормуРеквизитОбъекта(КонтекстЭлемента, "Подтверждение");
	ЭлементОтзыв 			= РедакторФорм.ДобавитьПолеФлажкаНаФормуРеквизитОбъекта(КонтекстЭлемента, "Отзыв");
	ЭлементКомментарий 		= РедакторФорм.ДобавитьПолеНаФормуРеквизитОбъекта(КонтекстЭлемента, "Комментарий");
	
КонецПроцедуры

#КонецОбласти