
&ИзменениеИКонтроль("УстановитьПрефикс")
Процедура пр_УстановитьПрефикс(Источник, Префикс, УстановитьПрефиксИнформационнойБазы, УстановитьПрефиксОрганизации)

	ПрефиксИнформационнойБазы = "";
	ПрефиксОрганизации        = "";

	Если УстановитьПрефиксИнформационнойБазы Тогда

		ПриОпределенииПрефиксаИнформационнойБазы(ПрефиксИнформационнойБазы);

		ДополнитьСтрокуНулямиСлева(ПрефиксИнформационнойБазы, 2);
	КонецЕсли;

	Если УстановитьПрефиксОрганизации Тогда

		Если РеквизитОрганизацияДоступен(Источник) Тогда
			
			#Удаление
			ПриОпределенииПрефиксаОрганизации(
				Источник[ИмяРеквизитаОрганизация(Источник.Метаданные())], ПрефиксОрганизации);
			#КонецУдаления
			#Вставка
			// Для документов, где нет реквизита "Организация"
			Попытка
				ПриОпределенииПрефиксаОрганизации(
					Источник[ИмяРеквизитаОрганизация(Источник.Метаданные())], ПрефиксОрганизации);
			Исключение
			    ПрефиксОрганизации = "ПР";
			КонецПопытки; 			
			#КонецВставки
			// Если задана пустая ссылка на организацию.
			Если ПрефиксОрганизации = Ложь Тогда

				ПрефиксОрганизации = "";

			КонецЕсли;

		КонецЕсли;

		ДополнитьСтрокуНулямиСлева(ПрефиксОрганизации, 2);
	КонецЕсли;

	ШаблонПрефикса = "[ОР][ИБ]-[Префикс]";
	ШаблонПрефикса = СтрЗаменить(ШаблонПрефикса, "[ОР]", ПрефиксОрганизации);
	ШаблонПрефикса = СтрЗаменить(ШаблонПрефикса, "[ИБ]", ПрефиксИнформационнойБазы);
	ШаблонПрефикса = СтрЗаменить(ШаблонПрефикса, "[Префикс]", Префикс);

	Префикс = ШаблонПрефикса;

КонецПроцедуры
