#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Аннотация не требуется, см. имя метода
//
// Параметры:
//   КонтактноеЛицо - СправочникСсылка.КонтактныеЛица
//    
// Возвращаемое значение:
//  Доступность1СКоннект - Булево
//
Функция пр_КонтактномуЛицуДоступен1СКоннект(КонтактноеЛицо) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Т1.Идентификатор КАК Идентификатор
		|ИЗ
		|	РегистрСведений.эсКоннектСоответствиеСотрудниковКлиентовКонтактнымЛицам КАК Т1
		|ГДЕ
		|	Т1.КонтактноеЛицо = &КонтактноеЛицо";
	
	Запрос.УстановитьПараметр("КонтактноеЛицо", КонтактноеЛицо);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат НЕ РезультатЗапроса.Пустой();
	
КонецФункции   

#КонецОбласти 	
	
#КонецЕсли 
